-- Classic 1.60 (WoW Forever): диалоги: gossip_menu, опции, npc_text, приветствия
-- Источник: снифы официального сервера Classic (бета «актуал»), сборки 70245, 70291, 70338, 70425; сгенерировано ForeverSniffTools.
-- Правила: данные новых сущностей Forever (entry >= 250000) заменяются, для старых только добавляется недостающее.
-- Повторный запуск безопасен. 

-- gossip: тексты меню берутся из BroadcastText (как в прежних sniff-файлах: npc_text.ID = 20000000 + MenuID)
INSERT IGNORE INTO `npc_text` (`ID`,`Probability0`,`Probability1`,`Probability2`,`Probability3`,`Probability4`,`Probability5`,`Probability6`,`Probability7`,`BroadcastTextID0`,`BroadcastTextID1`,`BroadcastTextID2`,`BroadcastTextID3`,`BroadcastTextID4`,`BroadcastTextID5`,`BroadcastTextID6`,`BroadcastTextID7`,`VerifiedBuild`) VALUES
(20032218,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,246152,0,0,0,0,0,0,0,70338),
(20041298,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,303584,0,0,0,0,0,0,0,70338),
(20042463,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,290402,0,0,0,0,0,0,0,70338),
(20042781,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,311553,0,0,0,0,0,0,0,70338),
(20043533,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,316796,0,0,0,0,0,0,0,70338),
(20044024,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,319820,0,0,0,0,0,0,0,70338),
(20044112,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,320480,0,0,0,0,0,0,0,70425),
(20044200,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,299856,0,0,0,0,0,0,0,70425),
(20044851,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,325813,0,0,0,0,0,0,0,70425),
(20045118,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,327175,0,0,0,0,0,0,0,70425),
(20045254,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,327795,0,0,0,0,0,0,0,70425);
INSERT IGNORE INTO `gossip_menu` (`MenuID`,`TextID`,`VerifiedBuild`) VALUES
(32218,20032218,70338),
(41298,20041298,70338),
(42463,20042463,70338),
(42781,20042781,70338),
(43533,20043533,70338),
(44024,20044024,70338),
(44112,20044112,70425),
(44200,20044200,70425),
(44851,20044851,70425),
(45118,20045118,70425),
(45254,20045254,70425);
INSERT IGNORE INTO `gossip_menu_option` (`MenuID`,`GossipOptionID`,`OptionID`,`OptionNpc`,`OptionText`,`OptionBroadcastTextID`,`Language`,`Flags`,`ActionMenuID`,`ActionPoiID`,`GossipNpcOptionID`,`BoxCoded`,`BoxMoney`,`BoxText`,`BoxBroadcastTextID`,`SpellID`,`OverrideIconID`,`VerifiedBuild`) VALUES
(681,95299,0,1,'Я хочу посмотреть на ваши товары.',0,0,0,0,0,NULL,0,0,NULL,0,NULL,NULL,70425),
(980,95758,0,0,'Что еще вы хотели сказать?',0,0,0,0,0,NULL,0,0,NULL,0,NULL,NULL,70338),
(1022,95974,0,3,'Обучи меня.',0,0,0,0,0,NULL,0,0,NULL,0,NULL,NULL,70338),
(1120,96233,0,1,'Мне бы хотелось купить что-нибудь у вас.',0,0,0,0,0,NULL,0,0,NULL,0,NULL,NULL,70338),
(1951,141421,13,0,'Трансмогрификатор',0,0,0,0,0,NULL,0,0,NULL,0,NULL,NULL,70338),
(1951,141990,14,0,'Парикмахерская',0,0,0,0,0,NULL,0,0,NULL,0,NULL,NULL,70338),
(2121,143270,12,0,'Парикмахерская',0,0,0,0,0,NULL,0,0,NULL,0,NULL,NULL,70425),
(2144,139184,7,0,'Шаман',0,0,0,0,0,NULL,0,0,NULL,0,NULL,NULL,70425),
(2168,98721,8,0,'Кожевничество',0,0,0,0,0,NULL,0,0,NULL,0,NULL,NULL,70425),
(2750,98198,0,3,'Обучи меня.',0,0,0,0,0,NULL,0,0,NULL,0,NULL,NULL,70338),
(2849,143249,12,0,'Парикмахерская',0,0,0,0,0,NULL,0,0,NULL,0,NULL,NULL,70338),
(4188,97291,0,3,'Обучи меня.',0,0,0,0,0,NULL,0,0,NULL,0,NULL,NULL,70338),
(4283,95551,0,1,'Позвольте мне взглянуть на ваш товар.',0,0,0,0,0,NULL,0,0,NULL,0,NULL,NULL,70338),
(4687,143672,3,0,'Я хочу забыть классовые или старинные таланты.',0,0,0,4463,0,NULL,0,0,NULL,0,NULL,NULL,70425),
(5782,139211,0,0,'Я хочу переписать свою историю.',0,0,0,42781,0,NULL,0,0,NULL,0,NULL,NULL,70338),
(40962,136542,1,0,'Острову Зефрис нужна помощь Ваятелей Ветра!\r\n\r\n<Объяснить Айессе план Валеннии.>',0,0,0,40960,0,NULL,0,0,NULL,0,NULL,NULL,70338),
(40964,136547,1,0,'Острову Зефрис нужна помощь Высшего ордена!\r\n\r\n<Объяснить Элаадрину план Валеннии.>',0,0,0,40966,0,NULL,0,0,NULL,0,NULL,NULL,70338),
(42781,139183,0,24,'Да. Я хочу забыть мои старинные таланты.',0,0,0,0,0,NULL,0,0,NULL,0,NULL,NULL,70338),
(43533,142210,0,1,'А что у вас есть?',0,0,0,0,0,NULL,0,0,NULL,0,NULL,NULL,70338),
(43828,143393,1,0,'Я хочу забыть классовые или старинные таланты.',0,0,0,4463,0,NULL,0,0,NULL,0,NULL,NULL,70338),
(44024,141301,0,1,'Show me what you have for sale.',0,0,0,0,0,NULL,0,0,NULL,0,NULL,NULL,70338),
(44112,141409,0,3,'Я хочу продолжить изучение мудрости друидов, дабы лучше понимать волю Матери-Земли.',0,0,0,0,0,NULL,0,0,NULL,0,NULL,NULL,70425);
INSERT IGNORE INTO `gossip_menu_option_locale` (`MenuID`,`OptionID`,`Locale`,`OptionText`,`BoxText`) VALUES
(681,0,'ruRU','Я хочу посмотреть на ваши товары.',NULL),
(980,0,'ruRU','Что еще вы хотели сказать?',NULL),
(1022,0,'ruRU','Обучи меня.',NULL),
(1120,0,'ruRU','Мне бы хотелось купить что-нибудь у вас.',NULL),
(1951,13,'ruRU','Трансмогрификатор',NULL),
(1951,14,'ruRU','Парикмахерская',NULL),
(2121,12,'ruRU','Парикмахерская',NULL),
(2144,7,'ruRU','Шаман',NULL),
(2168,8,'ruRU','Кожевничество',NULL),
(2750,0,'ruRU','Обучи меня.',NULL),
(2849,12,'ruRU','Парикмахерская',NULL),
(4188,0,'ruRU','Обучи меня.',NULL),
(4283,0,'ruRU','Позвольте мне взглянуть на ваш товар.',NULL),
(4687,3,'ruRU','Я хочу забыть классовые или старинные таланты.',NULL),
(5782,0,'ruRU','Я хочу переписать свою историю.',NULL),
(40962,1,'ruRU','Острову Зефрис нужна помощь Ваятелей Ветра!\r\n\r\n<Объяснить Айессе план Валеннии.>',NULL),
(40964,1,'ruRU','Острову Зефрис нужна помощь Высшего ордена!\r\n\r\n<Объяснить Элаадрину план Валеннии.>',NULL),
(42781,0,'ruRU','Да. Я хочу забыть мои старинные таланты.',NULL),
(43533,0,'ruRU','А что у вас есть?',NULL),
(43828,1,'ruRU','Я хочу забыть классовые или старинные таланты.',NULL),
(44024,0,'ruRU','Show me what you have for sale.',NULL),
(44112,0,'ruRU','Я хочу продолжить изучение мудрости друидов, дабы лучше понимать волю Матери-Земли.',NULL);
INSERT IGNORE INTO `creature_template_gossip` (`CreatureID`,`MenuID`,`VerifiedBuild`) VALUES
(2543,45254,70425),
(2784,44851,70425),
(2934,27279,70338),
(5675,32218,70338),
(246848,40562,70425),
(252085,44200,70425),
(260093,42463,70338),
(263645,43603,70338),
(270459,44112,70425),
(274781,2121,70425),
(276235,45118,70425);
INSERT IGNORE INTO `quest_greeting` (`ID`,`Type`,`GreetEmoteType`,`GreetEmoteDelay`,`Greeting`,`VerifiedBuild`) VALUES
(257944,0,0,0,'Поверить не могу, что ал\'акеты застали нас врасплох. Они с нами прежде не враждовали, но тут мои сородичи попали в их засаду, и многие были ранены. Клянусь, что отомщу за пострадавших и погибших друидов своего логова. Запомни мои слова: они поплатятся.',70338);
