-- Classic 1.60 (WoW Forever): тренеры
-- Источник: снифы официального сервера Classic (бета «актуал»), сборки 70245, 70291, 70338, 70425; сгенерировано ForeverSniffTools.
-- Правила: данные новых сущностей Forever (entry >= 250000) заменяются, для старых только добавляется недостающее.
-- Повторный запуск безопасен. 

INSERT IGNORE INTO `trainer_spell` (`TrainerId`,`SpellId`,`MoneyCost`,`ReqSkillLine`,`ReqSkillRank`,`ReqAbility1`,`ReqAbility2`,`ReqAbility3`,`ReqLevel`,`VerifiedBuild`) VALUES
(399,196,1000,0,0,0,0,0,0,70338),
(399,197,1000,0,0,0,0,0,0,70338),
(399,2567,1000,0,0,0,0,0,0,70338),
(399,264,1000,0,0,0,0,0,0,70338),
(397,2567,1000,0,0,0,0,0,0,70338),
(397,196,1000,0,0,0,0,0,0,70338),
(397,197,1000,0,0,0,0,0,0,70338),
(397,264,1000,0,0,0,0,0,0,70338),
(400,202,1000,0,0,0,0,0,0,70338),
(400,200,10000,0,0,0,0,0,20,70338);
INSERT IGNORE INTO `creature_trainer` (`CreatureID`,`TrainerID`,`MenuID`,`OptionID`) VALUES
(4552,36,0,0),
(4573,100,0,0),
(4586,361,0,0),
(4605,293,0,0),
(7087,113,0,0),
(11044,353,0,0),
(11067,357,0,0),
(251376,1234,0,0),
(270459,17,0,0);
